src/Catalogs/Сделки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Сделки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийНомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершенияСделки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСделки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Заявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеИсточники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформацииЗначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналПривлечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КаналыПривлечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналПривлеченияЗначение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Мессенджеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Необходим для конвертации бизнес-процессов в сделки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсЛечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КурсыЛечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лечение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланЛечения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланЛечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредыдущийПрием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксСинхронизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатСделки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специализация</Name>
					<Comment>Специализация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПациента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСделки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапОтказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапУспеха</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсторияИзмененияЭтапов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереходСЭтапа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереходНаЭтап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/РезультатыСделок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>РезультатыСделок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Успех</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ВидыСделок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыСделок</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСделки</Name>
					<Comment>Не используется</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеЭтапаУспех</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеЭтапаОтказ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтруктурныеЕдиницыПрименения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтатусыПациентовПрименения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатусПациента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПричиныОтказов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПричинаОтказа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныОтказов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ЭтапыСделок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЭтапыСделок</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветЭтапа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Сделки/Forms/ФормаВиджета/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события формы "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Контрагент"						, Контрагент);
	Параметры.Свойство("Сделка"							, Сделка);
	Параметры.Свойство("Врач"							, Врач);
	Параметры.Свойство("ВыбратьВидГенерируемойСделки"	, ВыбратьВидГенерируемойСделки);
	Параметры.Свойство("ВыбратьЭтапГенерируемойСделки"	, ВыбратьЭтапГенерируемойСделки);	
	Параметры.Свойство("ВыбранныйВидСделки"				, ВыбранныйВидСделки);
	Параметры.Свойство("ВыбранныйЭтап"					, ВыбранныйЭтап);
	
	ВыбратьЭтап = Ложь;
	Параметры.Свойство("ВыбратьЭтап", ВыбратьЭтап);
	ВыбратьЭтап = ?(ВыбратьЭтап = Неопределено, Ложь, ВыбратьЭтап);
	
	ИзменитьЭтапОтказ = Ложь;
	Параметры.Свойство("ИзменитьЭтапОтказ", ИзменитьЭтапОтказ);
	ИзменитьЭтапОтказ = ?(ИзменитьЭтапОтказ = Неопределено, Ложь, ИзменитьЭтапОтказ);
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Сделка) Тогда 
		ЭтотОбъект.СуммаСделки = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ЭтотОбъект.Сделка, "СуммаСделки");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВыбранныйВидСделки) Тогда 
		ЭтоПервичныйПовторныйПациент = ВыбранныйВидСделки = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты");	
	Иначе 
		ЭтоПервичныйПовторныйПациент = Ложь;	
	КонецЕсли;
	
	Если ВыбратьВидГенерируемойСделки ИЛИ ВыбратьЭтапГенерируемойСделки Тогда 
		ИнициализироватьТаблицуДоступныхВидовСделок();
		ОбновитьЭлементыВыбораГенерируемойСделки();
	Иначе
		Если ЗначениеЗаполнено(ЭтотОбъект.Сделка) Тогда 
			СтруктураОсновыныхРеквизитов = ОбщегоНазначенияСтоматология.ПолучитьЗначенияРеквизитов(Сделка, "ВидСделки, ЭтапСделки, РезультатСделки, ПричинаОтказа");
			ВидСделки 		= СтруктураОсновыныхРеквизитов.ВидСделки;
			РезультатСделки = СтруктураОсновыныхРеквизитов.РезультатСделки;
			ЭтапСделки 		= СтруктураОсновыныхРеквизитов.ЭтапСделки;
			ПричинаОтказа 	= СтруктураОсновыныхРеквизитов.ПричинаОтказа;
		КонецЕсли;
		ЭтоПервичныйПовторныйПациент = ВидСделки = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты");	
		УправлениеИнтерфейсамиСервер.ЗаполнитьТаблицуПричинОтказов(ЭтаФорма, ВидСделки, ПричиныПредопределены);
		ОбновитьЭтапыСделки();
	КонецЕсли;	
	
	ЭтаФорма.Заголовок = Сделка.Наименование;
	
	УстановитьВидимостьЭлементов(ВыбратьЭтап, ИзменитьЭтапОтказ)
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
// Процедура, обработчик события "Выбор".
//
Процедура СписокВидовСделокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекстОшибки = "";
	ЭлементСписка = СписокВидовСделок.Получить(ВыбраннаяСтрока);
	Если ЗначениеЗаполнено(ЭлементСписка.Значение) Тогда 
		УправлениеИнтерфейсамиСервер.ИзменитьВидСделки(ЭтотОбъект.Сделка, ЭлементСписка.Значение, ТекстОшибки);
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	Иначе
		Оповестить("ОБНОВИТЬ_ЭТАПЫ_СДЕЛКИ");
		Оповестить("ОБНОВИТЬ_ВИДЖЕТ_СДЕЛКИ");
		Если ЭтаФорма.Открыта() Тогда
			ЭтаФорма.Закрыть();
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура СуммаСделкиПриИзменении(Элемент)
	
	УправлениеИнтерфейсамиСервер.ИзменитьСуммуСделки(ЭтотОбъект.Сделка, ЭтотОбъект.СуммаСделки);
	Если ЭтаФорма.Открыта() Тогда
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, ОбработчикТаблицаОтказовВыбор.
//
Процедура ОбработчикТаблицаОтказовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) Экспорт
	
	ПричинаОтказа = Элемент.ТекущиеДанные.Ссылка;
	ИмяЭлемента   = Элемент.Имя;
	
	ОбновитьПричинуОтказаВыборНаСервере(ПричинаОтказа, ИмяЭлемента);	
	Оповестить("ОБНОВИТЬ_ЭТАПЫ_СДЕЛКИ");
	Оповестить("ОБНОВИТЬ_ВИДЖЕТ_СДЕЛКИ");
	Если ЭтаФорма.Открыта() Тогда
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - Открыть сделку.
//
Процедура ОткрытьСделку(Команда)
	
	ПоказатьЗначение(,ЭтотОбъект.Сделка);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Сменить сделку.
//
Процедура СменитьСделку(Команда)
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Сделка) Тогда 
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ЭтотОбъект.Сделка, "ВидСделки"), "Предопределенный") Тогда 
		Возврат;
	КонецЕсли;
	
	СменитьСделкуНаСервере();
	
КонецПроцедуры

&НаКлиенте
// Процедура, ОбработчикНажатияИзменитьЭтап.
//
Процедура ОбработчикНажатияИзменитьЭтап(Команда) Экспорт
	
	ИндексВиджета = 0;
	
	Если СтрНайти(Команда.Имя, "Этап_Генерируемый_") <> 0 Тогда 
		Если СтрНачинаетсяС(Команда.Имя, "Этап_Генерируемый_") Тогда  
			ИндексСтроки			= Число(Сред(Команда.Имя, СтрДлина("Этап_Генерируемый_") + 1));
		ИначеЕсли СтрНачинаетсяС(Команда.Имя, "КомандаЭтап_Генерируемый_") Тогда  
			ИндексСтроки			= Число(Сред(Команда.Имя, СтрДлина("КомандаЭтап_Генерируемый_") + 1));
		Иначе 
			Возврат;
		КонецЕсли;	
		Для Каждого СтрокаВидСделки Из ТаблицаДоступныхВидовСделок Цикл 
			Если СтрокаВидСделки.ВидСделки = ВыбранныйВидСделки Тогда
				Для Каждого СтрокаЭтап Из СтрокаВидСделки.ТаблицаЭтапов Цикл 
					СтрокаЭтап.Выбран = СтрокаВидСделки.ТаблицаЭтапов.Индекс(СтрокаЭтап) = ИндексСтроки;
					Если СтрокаЭтап.Выбран Тогда 
						ВыбранныйЭтап = СтрокаЭтап.Этап;
					КонецЕсли;	
				КонецЦикла;	
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЭтаФорма.Открыта() Тогда
			ЭтаФорма.Закрыть(ВыбранныйЭтап);
		КонецЕсли;		
		
	ИначеЕсли СтрНайти(Команда.Имя, "КомандаИзменитьЭтапОтказ") > 0 Тогда
		Если ПричиныПредопределены Тогда 			
			ПричинаОтказа = ПолучитьВыбраннуюПричинуОтказа(Команда.Имя);
			ОбновитьПричинуОтказаВыборНаСервере(ПричинаОтказа, Команда.Имя);	
			Оповестить("ОБНОВИТЬ_ЭТАПЫ_СДЕЛКИ");
			Оповестить("ОБНОВИТЬ_ВИДЖЕТ_СДЕЛКИ");
			Если ЭтаФорма.Открыта() Тогда
				ЭтаФорма.Закрыть();
			КонецЕсли;
		Иначе 	
			Элементы["ГруппаЭтапы_" + ИндексВиджета].Видимость   	   	= Ложь;
			Элементы["ГруппаПричиныОтказа_" + ИндексВиджета].Видимость 	= Истина;
			Элементы["ГруппаПрием_" + ИндексВиджета].Видимость    		= Ложь;
			
			Элементы.ГруппаШапкаЗавершающихЭтаповСделок.Видимость = Ложь;
			
		КонецЕсли;
	ИначеЕсли СтрНайти(Команда.Имя, "КомандаИзменитьЭтапУспех") > 0 Тогда
		
		Элементы["ГруппаЭтапы_" + ИндексВиджета].Видимость   	   		= Ложь;
		Элементы["ГруппаПричиныОтказа_" + ИндексВиджета].Видимость 		= Ложь;
		Элементы["ГруппаПрием_" + ИндексВиджета].Видимость    			= Истина;
		
		Элементы.ГруппаШапкаЗавершающихЭтаповСделок.Видимость = Ложь;
			
	ИначеЕсли СтрНайти(Команда.Имя, "КомандаСоздатьПродажу") > 0 Тогда
		
		ОткрытьФормуПродажи(ИндексВиджета);
		
	ИначеЕсли СтрНайти(Команда.Имя, "КомандаВыбратьПродажу") > 0 Тогда
		
		МассивСделок = Новый Массив();
		МассивСделок.Добавить(ЭтотОбъект.Сделка);
		
		НовоеОповещение = Новый ОписаниеОповещения("ВыбратьРеализациюЗавершение", ЭтотОбъект, ЭтотОбъект.Сделка);
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("Контрагент"			, ЭтотОбъект.Контрагент);
		ПараметрыФормы.Вставить("ВключатьПакетИЧленство", Истина);
		ПараметрыФормы.Вставить("РеализацияБезСделки"	, Истина);
		ПараметрыФормы.Вставить("МассивСделок"			, МассивСделок);
		
		ОткрытьФорму("Документ.Прием.ФормаВыбора",ПараметрыФормы,,,,,НовоеОповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе
		ОбновитьСделку(Команда.Имя);
		Оповестить("ОБНОВИТЬ_ЭТАПЫ_СДЕЛКИ");
		Оповестить("ОБНОВИТЬ_ВИДЖЕТ_СДЕЛКИ");
		Если ЭтаФорма.Открыта() Тогда
			ЭтаФорма.Закрыть();
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, ОбработчикНажатияИзменитьЭтап.
//
Процедура ОбработчикНажатияИзменитьВидСделки(Команда) Экспорт
	
	ИндексВиджета = 0;
	
	Если СтрНачинаетсяС(Команда.Имя, "КомандаВидСделки_") Тогда  
		ИндексСтроки			= Число(Сред(Команда.Имя, СтрДлина("КомандаВидСделки_") + 1));
		Если НЕ ТаблицаДоступныхВидовСделок[ИндексСтроки].ВидСделки = ВыбранныйВидСделки Тогда 
			Для Каждого СтрокаВидСделки Из ТаблицаДоступныхВидовСделок Цикл
				Если СтрокаВидСделки.Выбран Тогда 
					Для Каждого СтрокаЭтап Из СтрокаВидСделки.ТаблицаЭтапов Цикл 
						СтрокаЭтап.Выбран = Ложь;
					КонецЦикла;	
				КонецЕсли;	
				СтрокаВидСделки.Выбран 	= ТаблицаДоступныхВидовСделок.Индекс(СтрокаВидСделки) = ИндексСтроки;
				Если СтрокаВидСделки.Выбран Тогда 
					ВыбранныйВидСделки = СтрокаВидСделки.ВидСделки;					
					СтрокаВидСделки.ТаблицаЭтапов[0].Выбран = Истина;
				КонецЕсли;	
			КонецЦикла; 
			Если ЗначениеЗаполнено(ВыбранныйВидСделки) Тогда 
				ЭтоПервичныйПовторныйПациент = ВыбранныйВидСделки = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты");	
			Иначе 
				ЭтоПервичныйПовторныйПациент = Ложь;	
			КонецЕсли;			
		КонецЕсли;
		Если ЭтаФорма.Открыта() Тогда
			ЭтаФорма.Закрыть(ВыбранныйВидСделки);
		КонецЕсли;		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура - Инициализировать таблицу доступных видов сделок
//
Процедура ИнициализироватьТаблицуДоступныхВидовСделок()
	
	ТаблицаДоступныхВидовСделокДляГенерации = Справочники.ВидыСделок.ПолучитьДоступныеДляГенерацииВидыСделок(, Контрагент, , Врач, Истина);
	ТаблицаДоступныхВидовСделок.Очистить();
	Для Каждого СтрокаДоступныеВидыСделок Из ТаблицаДоступныхВидовСделокДляГенерации Цикл
		НоваяСтрока = ТаблицаДоступныхВидовСделок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДоступныеВидыСделок, , "ТаблицаЭтапов, ТаблицаПричинОтказов");
		НоваяСтрока.Выбран = НоваяСтрока.ВидСделки = ВыбранныйВидСделки;
		НоваяСтрока.ТаблицаЭтапов.Загрузить(СтрокаДоступныеВидыСделок.ТаблицаЭтапов);
		НоваяСтрока.ТаблицаПричинОтказов.Загрузить(СтрокаДоступныеВидыСделок.ТаблицаПричинОтказов);
		Если НоваяСтрока.Выбран Тогда 
			Если ЗначениеЗаполнено(ВыбранныйЭтап) Тогда 
				МассивСтрок = НоваяСтрока.ТаблицаЭтапов.НайтиСтроки(Новый Структура("Этап", ВыбранныйЭтап));
				Если МассивСтрок.Количество() > 0 Тогда 
					МассивСтрок[0].Выбран = Истина;
				КонецЕсли;
			Иначе 
				
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить элементы выбора вида генерируемой сделки
//
Процедура ОбновитьЭлементыВыбораГенерируемойСделки()
	
	ОбновитьЭлементыВыбораВидаГенерируемойСделки();
	ОбновитьЭлементыВыбораЭтапаГенерируемойСделки();
	ОбновитьЭлементыВыбораЗавершающихЭтаповГенерируемойСделки();
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить элементы выбора вида генерируемой сделки
//
Процедура ОбновитьЭлементыВыбораВидаГенерируемойСделки();
	
	ГруппаРодитель 		= Элементы.ГруппаВидовСделок;
	
	// Создание группы.
	ПараметрыГруппы = Новый Структура;
	ПараметрыГруппы.Вставить("ИмяЭлемента"   		, "ГруппаВидыСделок_Общая");
	ПараметрыГруппы.Вставить("ГруппаЭлемента"		, ГруппаРодитель);	
	ПараметрыГруппы.Вставить("Группировка"   		, ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
	ГруппаВидыСделок = УправлениеИнтерфейсамиСервер.СоздатьЭлементГруппа(ЭтаФорма, ПараметрыГруппы);
	ГруппаВидыСделок.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Одинарный;
	
	Для Каждого СтрокаТЗ Из ТаблицаДоступныхВидовСделок Цикл
		
		Индекс = ТаблицаДоступныхВидовСделок.Индекс(СтрокаТЗ);
		
		// Создание группы Вида.
		ПараметрыГруппы = Новый Структура;
		ПараметрыГруппы.Вставить("ИмяЭлемента"   , "ГруппаВидСделки_" + Индекс);
		ПараметрыГруппы.Вставить("ГруппаЭлемента", ГруппаВидыСделок);
		ПараметрыГруппы.Вставить("Группировка"   , ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
		ГруппаВидСделки = УправлениеИнтерфейсамиСервер.СоздатьЭлементГруппа(ЭтаФорма, ПараметрыГруппы);
		ГруппаВидСделки.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Полуторный;
		ГруппаВидСделки.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
		ГруппаВидСделки.Ширина = 30;
		ГруппаВидСделки.РастягиватьПоГоризонтали = Ложь;
				
		// Создаем картинку
		ПараметрыДекорации = Новый Структура;
		ПараметрыДекорации.Вставить("ИмяЭлемента"				, "Картинка_Выбран_ВидСделки" + Индекс);
		ПараметрыДекорации.Вставить("ГруппаЭлемента"			, ГруппаВидСделки);
		ПараметрыДекорации.Вставить("Картинка"					, ?(СтрокаТЗ.Выбран, БиблиотекаКартинок.ЧекБоксПолный, БиблиотекаКартинок.Пустая));
		//ПараметрыДекорации.Вставить("ИмяОбработчикаНажатия"		, "ОбработчикНажатияИзменитьЭтап");
		ПараметрыДекорации.Вставить("РастягиватьПоГоризонтали"	, Ложь);
		КартинкаВида = УправлениеИнтерфейсамиСервер.СоздатьЭлементДекорация(ЭтаФорма, ПараметрыДекорации);
		КартинкаВида.АвтоМаксимальнаяШирина	 				= Ложь;		
		КартинкаВида.Ширина					 				= 2;
		КартинкаВида.Высота					 				= 1;
		КартинкаВида.ВертикальноеПоложениеВГруппе 			= ВертикальноеПоложениеЭлемента.Центр;
		
		// Создание группы кнопки вида сделки.
		ПараметрыГруппы = Новый Структура;
		ПараметрыГруппы.Вставить("ИмяЭлемента"   , "ВидСделки_ГруппаКнопки" + Индекс);
		ПараметрыГруппы.Вставить("ГруппаЭлемента", ГруппаВидСделки);
		ПараметрыГруппы.Вставить("Группировка"   , ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
		ГруппаКнопкиВидаСделки = УправлениеИнтерфейсамиСервер.СоздатьЭлементГруппа(ЭтаФорма, ПараметрыГруппы);
		ГруппаКнопкиВидаСделки.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
		ГруппаКнопкиВидаСделки.Ширина = 30;
		ГруппаКнопкиВидаСделки.РастягиватьПоГоризонтали = Ложь;
		
		// Создаем команду кнопки.
		ПараметрыКоманды = Новый Структура;
		ПараметрыКоманды.Вставить("ИмяОбработчикаНажатия", "ОбработчикНажатияИзменитьВидСделки");
		ПараметрыКоманды.Вставить("ИмяЭлемента"   	 	 , "ВидСделки_" + Индекс);
		КомандаКнопки =  УправлениеИнтерфейсамиСервер.СоздатьКомандуЭлемента(ЭтаФорма, ПараметрыКоманды);
		
		// Создаем кнопку.
		ПараметрыКнопки = Новый Структура;
		ПараметрыКнопки.Вставить("Заголовок"   	 	 , СтрокаТЗ.Наименование);
		ПараметрыКнопки.Вставить("ИмяЭлемента"   	 , "ВидСделки_" + Индекс);
		ПараметрыКнопки.Вставить("КнопкаОтображение" , ОтображениеКнопки.Текст);
		ПараметрыКнопки.Вставить("КомандаКнопки" 	 , КомандаКнопки);
		ПараметрыКнопки.Вставить("РазмерШрифта"  	 , 10);
		ПараметрыКнопки.Вставить("ГруппаЭлемента"	 , ГруппаКнопкиВидаСделки);		
		
		КнопкаВидвСделки = УправлениеИнтерфейсамиСервер.СоздатьЭлементКнопка(ЭтаФорма, ПараметрыКнопки);
		КнопкаВидвСделки.РастягиватьПоГоризонтали 	= Истина;	 
		//КнопкаЭтапа.АвтоМаксимальнаяШирина 		= Ложь;	 
		//КнопкаЭтапа.МаксимальнаяШирина 			= 24;	 
		
		Если СтрокаТЗ.ТаблицаЭтапов.Количество() > 0 Тогда 
			ЦветЭтапа = СтрокаТЗ.ТаблицаЭтапов[0].ЦветЭтапа;
		Иначе 
			ЦветЭтапа = Новый Цвет(0,112,210);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ЦветЭтапа)
			ИЛИ ЗначениеИзСтрокиВнутр(ЦветЭтапа) = Новый Цвет()
			ИЛИ НЕ СтрокаТЗ.Выбран Тогда
			
			Цвет = Новый Цвет(243, 243, 243);
		Иначе		
			Цвет = ЗначениеИзСтрокиВнутр(ЦветЭтапа);
		КонецЕсли;
		
		ГруппаКнопкиВидаСделки.ЦветФона   	= Цвет;
		КнопкаВидвСделки.ЦветТекста 		= УправлениеИнтерфейсамиСервер.ПолучитьЦветТекстаПоФону(ГруппаКнопкиВидаСделки.ЦветФона);
		
		// Создаем картинку
		ПараметрыДекорации = Новый Структура;
		ПараметрыДекорации.Вставить("ИмяЭлемента"				, "Картинка_Выбран_ВидСделки_Пустая" + Индекс);
		ПараметрыДекорации.Вставить("ГруппаЭлемента"			, ГруппаВидСделки);
		ПараметрыДекорации.Вставить("Картинка"					, БиблиотекаКартинок.Пустая);
		//ПараметрыДекорации.Вставить("ИмяОбработчикаНажатия"		, "ОбработчикНажатияИзменитьЭтап");
		ПараметрыДекорации.Вставить("РастягиватьПоГоризонтали"	, Ложь);
		КартинкаВида = УправлениеИнтерфейсамиСервер.СоздатьЭлементДекорация(ЭтаФорма, ПараметрыДекорации);
		КартинкаВида.АвтоМаксимальнаяШирина	 				= Ложь;		
		КартинкаВида.Ширина					 				= 2;
		КартинкаВида.Высота					 				= 1;
		КартинкаВида.ВертикальноеПоложениеВГруппе 			= ВертикальноеПоложениеЭлемента.Центр;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить элементы выбора этапа генерируемой сделки
//
Процедура ОбновитьЭлементыВыбораЭтапаГенерируемойСделки();
	
	ТаблицаЭтапов = Неопределено;
	МассивСтрок = ТаблицаДоступныхВидовСделок.НайтиСтроки(Новый Структура("ВидСделки", ВыбранныйВидСделки));
	Если МассивСтрок.Количество() > 0 Тогда 
		ТаблицаЭтапов = МассивСтрок[0].ТаблицаЭтапов;
		ИндексВиджета = ТаблицаДоступныхВидовСделок.Индекс(МассивСтрок[0]);		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТаблицаЭтапов) Тогда 
		Возврат;
	КонецЕсли;
	
	ГруппаРодитель 		= Элементы.ГруппаЭтапы;
	
	// Создание группы.
	ПараметрыГруппы = Новый Структура;
	ПараметрыГруппы.Вставить("ИмяЭлемента"   		, "ГруппаЭтапы_" + ИндексВиджета);
	ПараметрыГруппы.Вставить("ГруппаЭлемента"		, ГруппаРодитель);	
	ПараметрыГруппы.Вставить("Группировка"   		, ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
	ГруппаЭтапы = УправлениеИнтерфейсамиСервер.СоздатьЭлементГруппа(ЭтаФорма, ПараметрыГруппы);
	ГруппаЭтапы.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
	
	МассивСтрокВыбранногоЭтапа = ТаблицаЭтапов.НайтиСтроки(Новый Структура("Выбран", Истина));
	Если НЕ МассивСтрокВыбранногоЭтапа.Количество() = 0 Тогда 
		НомерЭтапа = МассивСтрокВыбранногоЭтапа[0].НомерЭтапа;
	Иначе 
		НомерЭтапа = 0;
	КонецЕсли;
	
	Для Каждого СтрокаТЗ Из ТаблицаЭтапов Цикл
		
		Если СтрокаТЗ.Предопределенный Тогда 
			Продолжить;
		КонецЕсли;
		
		Индекс = ТаблицаЭтапов.Индекс(СтрокаТЗ);
		
		Если НЕ Индекс = 0 Тогда 
			// Создаем картинку
			ПараметрыДекорации = Новый Структура;
			ПараметрыДекорации.Вставить("ИмяЭлемента"				, "Картинка_СтрелкаВниз_" + Индекс);
			ПараметрыДекорации.Вставить("ГруппаЭлемента"			, ГруппаЭтапы);
			ПараметрыДекорации.Вставить("Картинка"					, БиблиотекаКартинок.СтрелкаВниз);
			//ПараметрыДекорации.Вставить("ИмяОбработчикаНажатия"		, "ОбработчикНажатияИзменитьЭтап");
			ПараметрыДекорации.Вставить("РастягиватьПоГоризонтали"	, Ложь);
			КартинкаВида = УправлениеИнтерфейсамиСервер.СоздатьЭлементДекорация(ЭтаФорма, ПараметрыДекорации);
			КартинкаВида.АвтоМаксимальнаяШирина	 				= Ложь;		
			КартинкаВида.Ширина					 				= 2;
			КартинкаВида.Высота					 				= 1;
			КартинкаВида.ВертикальноеПоложениеВГруппе 			= ВертикальноеПоложениеЭлемента.Центр;
			КартинкаВида.ГоризонтальноеПоложениеВГруппе 		= ГоризонтальноеПоложениеЭлемента.Центр;
		КонецЕсли;
	
		// Создание группы этапа.
		ПараметрыГруппы = Новый Структура;
		ПараметрыГруппы.Вставить("ИмяЭлемента"   , "ГруппаЭтапа_" + Индекс);
		ПараметрыГруппы.Вставить("ГруппаЭлемента", ГруппаЭтапы);
		ПараметрыГруппы.Вставить("Группировка"   , ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
		ГруппаЭтапа = УправлениеИнтерфейсамиСервер.СоздатьЭлементГруппа(ЭтаФорма, ПараметрыГруппы);
		ГруппаЭтапа.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Полуторный;
		ГруппаЭтапа.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
		ГруппаЭтапа.Ширина = 30;
		ГруппаЭтапа.РастягиватьПоГоризонтали = Ложь;
				
		// Создаем картинку
		ПараметрыДекорации = Новый Структура;
		ПараметрыДекорации.Вставить("ИмяЭлемента"				, "Картинка_Выбран_ЭтапСделки" + Индекс);
		ПараметрыДекорации.Вставить("ГруппаЭлемента"			, ГруппаЭтапа);
		ПараметрыДекорации.Вставить("Картинка"					, ?(СтрокаТЗ.Выбран, БиблиотекаКартинок.ЧекБоксПолный, БиблиотекаКартинок.Пустая));
		//ПараметрыДекорации.Вставить("ИмяОбработчикаНажатия"		, "ОбработчикНажатияИзменитьЭтап");
		ПараметрыДекорации.Вставить("РастягиватьПоГоризонтали"	, Ложь);
		КартинкаВида = УправлениеИнтерфейсамиСервер.СоздатьЭлементДекорация(ЭтаФорма, ПараметрыДекорации);
		КартинкаВида.АвтоМаксимальнаяШирина	 				= Ложь;		
		КартинкаВида.Ширина					 				= 2;
		КартинкаВида.Высота					 				= 1;
		КартинкаВида.ВертикальноеПоложениеВГруппе 			= ВертикальноеПоложениеЭлемента.Центр;
		
		// Создание группы кнопки этапа.
		ПараметрыГруппы = Новый Структура;
		ПараметрыГруппы.Вставить("ИмяЭлемента"   , "Этап_ГруппаКнопки" + Индекс);
		ПараметрыГруппы.Вставить("ГруппаЭлемента", ГруппаЭтапа);
		ПараметрыГруппы.Вставить("Группировка"   , ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
		ГруппаКнопкиЭтапа = УправлениеИнтерфейсамиСервер.СоздатьЭлементГруппа(ЭтаФорма, ПараметрыГруппы);
		ГруппаКнопкиЭтапа.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
		ГруппаКнопкиЭтапа.Ширина = 30;
		ГруппаКнопкиЭтапа.РастягиватьПоГоризонтали = Ложь;
		
		// Создаем команду кнопки.
		ПараметрыКоманды = Новый Структура;
		ПараметрыКоманды.Вставить("ИмяОбработчикаНажатия", "ОбработчикНажатияИзменитьЭтап");
		ПараметрыКоманды.Вставить("ИмяЭлемента"   	 	 , "Этап_Генерируемый_" + Индекс);
		КомандаКнопки =  УправлениеИнтерфейсамиСервер.СоздатьКомандуЭлемента(ЭтаФорма, ПараметрыКоманды);
		
		// Создаем кнопку.
		ПараметрыКнопки = Новый Структура;
		ПараметрыКнопки.Вставить("Заголовок"   	 	 , СтрокаТЗ.Наименование);
		ПараметрыКнопки.Вставить("ИмяЭлемента"   	 , "Этап_Генерируемый_" + Индекс);
		ПараметрыКнопки.Вставить("КнопкаОтображение" , ОтображениеКнопки.Текст);
		ПараметрыКнопки.Вставить("КомандаКнопки" 	 , КомандаКнопки);
		ПараметрыКнопки.Вставить("РазмерШрифта"  	 , 10);
		ПараметрыКнопки.Вставить("ГруппаЭлемента"	 , ГруппаКнопкиЭтапа);		
		
		КнопкаЭтапа = УправлениеИнтерфейсамиСервер.СоздатьЭлементКнопка(ЭтаФорма, ПараметрыКнопки);
		КнопкаЭтапа.РастягиватьПоГоризонтали 	= Истина;	 
		//КнопкаЭтапа.АвтоМаксимальнаяШирина 		= Ложь;	 
		//КнопкаЭтапа.МаксимальнаяШирина 			= 24;	 
		
		Если ЭтоПервичныйПовторныйПациент Тогда
			Если СтрокаТЗ.НомерЭтапа = 1 ИЛИ СтрокаТЗ.НомерЭтапа = 2 Тогда
				КнопкаЭтапа.Доступность 		= НомерЭтапа < 3;
			ИначеЕсли СтрокаТЗ.НомерЭтапа = 3 Тогда 
				КнопкаЭтапа.Доступность 		= Ложь;
			ИначеЕсли СтрокаТЗ.НомерЭтапа = 4 Тогда 	
				КнопкаЭтапа.Доступность 		= Ложь; //НомерЭтапа > 2;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЗ.ЦветЭтапа)
			ИЛИ ЗначениеИзСтрокиВнутр(СтрокаТЗ.ЦветЭтапа) = Новый Цвет()
			ИЛИ СтрокаТЗ.НомерЭтапа > НомерЭтапа Тогда 
			Если СтрокаТЗ.Выбран Тогда
				Цвет = Новый Цвет(229, 229, 229);
			Иначе 	
				Цвет = Новый Цвет(243, 243, 243);
			КонецЕсли;
		ИначеЕсли СтрокаТЗ.Выбран Тогда
			Цвет = ЗначениеИзСтрокиВнутр(СтрокаТЗ.ЦветЭтапа);
		Иначе		
			Цвет = ЗначениеИзСтрокиВнутр(СтрокаТЗ.ЦветЭтапа);
		КонецЕсли;
		
		ГруппаКнопкиЭтапа.ЦветФона   	= Цвет;
		КнопкаЭтапа.ЦветТекста 			= УправлениеИнтерфейсамиСервер.ПолучитьЦветТекстаПоФону(ГруппаКнопкиЭтапа.ЦветФона);
		
		// Создаем картинку
		ПараметрыДекорации = Новый Структура;
		ПараметрыДекорации.Вставить("ИмяЭлемента"				, "Картинка_Выбран_ЭтапСделки_пустая" + Индекс);
		ПараметрыДекорации.Вставить("ГруппаЭлемента"			, ГруппаЭтапа);
		ПараметрыДекорации.Вставить("Картинка"					, БиблиотекаКартинок.Пустая);
		//ПараметрыДекорации.Вставить("ИмяОбработчикаНажатия"		, "ОбработчикНажатияИзменитьЭтап");
		ПараметрыДекорации.Вставить("РастягиватьПоГоризонтали"	, Ложь);
		КартинкаВида = УправлениеИнтерфейсамиСервер.СоздатьЭлементДекорация(ЭтаФорма, ПараметрыДекорации);
		КартинкаВида.АвтоМаксимальнаяШирина	 				= Ложь;		
		КартинкаВида.Ширина					 				= 2;
		КартинкаВида.Высота					 				= 1;
		КартинкаВида.ВертикальноеПоложениеВГруппе 			= ВертикальноеПоложениеЭлемента.Центр;
		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
// Процедура - Обновить элементы выбора завершающих этапов генерируемой сделки
//
Процедура ОбновитьЭлементыВыбораЗавершающихЭтаповГенерируемойСделки();
	
	ТаблицаЭтапов = Неопределено;
	МассивСтрок = ТаблицаДоступныхВидовСделок.НайтиСтроки(Новый Структура("ВидСделки", ВыбранныйВидСделки));
	Если МассивСтрок.Количество() > 0 Тогда 
		ТаблицаЭтапов = МассивСтрок[0].ТаблицаЭтапов;
		ИндексВиджета = ТаблицаДоступныхВидовСделок.Индекс(МассивСтрок[0]);
		НаименованиеЭтапаУспех = МассивСтрок[0].НаименованиеЭтапаУспех;
		НаименованиеЭтапаОтказ = МассивСтрок[0].НаименованиеЭтапаОтказ;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТаблицаЭтапов) Тогда 
		Возврат;
	КонецЕсли;
	
	ГруппаРодитель 					= Элементы.ГруппаЗавершающиеЭтапы;
	ДоступностьЗавершающихЭтапов 	= НЕ ЭтоПервичныйПовторныйПациент;
	
	// Создание группы.
	ПараметрыГруппы = Новый Структура;
	ПараметрыГруппы.Вставить("ИмяЭлемента"   		, "ГруппаЗавершающиеЭтапы_" + ИндексВиджета);
	ПараметрыГруппы.Вставить("ГруппаЭлемента"		, ГруппаРодитель);	
	ПараметрыГруппы.Вставить("Группировка"   		, ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
	ГруппаЭтапы = УправлениеИнтерфейсамиСервер.СоздатьЭлементГруппа(ЭтаФорма, ПараметрыГруппы);
	ГруппаЭтапы.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Одинарный;
		
	Для Каждого СтрокаТЗ Из ТаблицаЭтапов Цикл
		
		Если НЕ СтрокаТЗ.Предопределенный Тогда 
			Продолжить;
		КонецЕсли;
		
		Индекс = ТаблицаЭтапов.Индекс(СтрокаТЗ);
		Если СтрокаТЗ.Этап = Справочники.ЭтапыСделок.Успех Тогда 
			УправлениеИнтерфейсамиСервер.СоздатьКнопкуРезультатаСделки(ЭтаФорма, НаименованиеЭтапаУспех, ГруппаЭтапы, , , Перечисления.РезультатыСделок.Успех, РезультатСделки, Индекс, ДоступностьЗавершающихЭтапов);
		КонецЕсли;
		
		Если СтрокаТЗ.Этап = Справочники.ЭтапыСделок.Отказ Тогда 
			Если ЗначениеЗаполнено(МассивСтрок[0].ТаблицаПричинОтказов) Тогда
				Для Каждого СтрокаПричина Из МассивСтрок[0].ТаблицаПричинОтказов Цикл 
					УправлениеИнтерфейсамиСервер.СоздатьКнопкуРезультатаСделки(ЭтаФорма, СокрЛП(СтрокаПричина.Наименование), ГруппаЭтапы, , , Перечисления.РезультатыСделок.Отказ, РезультатСделки, МассивСтрок[0].ТаблицаПричинОтказов.Индекс(СтрокаПричина), ДоступностьЗавершающихЭтапов);
				КонецЦикла;
			Иначе 
				УправлениеИнтерфейсамиСервер.СоздатьКнопкуРезультатаСделки(ЭтаФорма, НаименованиеЭтапаОтказ, ГруппаЭтапы, , , , , Индекс, ДоступностьЗавершающихЭтапов);		
			КонецЕсли;
		КонецЕсли;
	
	//	//Если НЕ Индекс = 0 Тогда 
	//	//	// Создаем картинку
	//	//	ПараметрыДекорации = Новый Структура;
	//	//	ПараметрыДекорации.Вставить("ИмяЭлемента"				, "Картинка_СтрелкаВниз_" + Индекс);
	//	//	ПараметрыДекорации.Вставить("ГруппаЭлемента"			, ГруппаЭтапы);
	//	//	ПараметрыДекорации.Вставить("Картинка"					, БиблиотекаКартинок.СтрелкаВниз);
	//	//	//ПараметрыДекорации.Вставить("ИмяОбработчикаНажатия"		, "ОбработчикНажатияИзменитьЭтап");
	//	//	ПараметрыДекорации.Вставить("РастягиватьПоГоризонтали"	, Ложь);
	//	//	КартинкаВида = УправлениеИнтерфейсамиСервер.СоздатьЭлементДекорация(ЭтаФорма, ПараметрыДекорации);
	//	//	КартинкаВида.АвтоМаксимальнаяШирина	 				= Ложь;		
	//	//	КартинкаВида.Ширина					 				= 2;
	//	//	КартинкаВида.Высота					 				= 1;
	//	//	КартинкаВида.ВертикальноеПоложениеВГруппе 			= ВертикальноеПоложениеЭлемента.Центр;
	//	//	КартинкаВида.ГоризонтальноеПоложениеВГруппе 		= ГоризонтальноеПоложениеЭлемента.Центр;
	//	//КонецЕсли;
	//
	//	// Создание группы завершающих этапов.
	//	ПараметрыГруппы = Новый Структура;
	//	ПараметрыГруппы.Вставить("ИмяЭлемента"   , "ГруппаЗавершающегоЭтапа_" + Индекс);
	//	ПараметрыГруппы.Вставить("ГруппаЭлемента", ГруппаЭтапы);
	//	ПараметрыГруппы.Вставить("Группировка"   , ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
	//	ГруппаЭтапа = УправлениеИнтерфейсамиСервер.СоздатьЭлементГруппа(ЭтаФорма, ПараметрыГруппы);
	//	ГруппаЭтапа.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Полуторный;
	//	ГруппаЭтапа.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
	//	ГруппаЭтапа.Ширина = 30;
	//	ГруппаЭтапа.РастягиватьПоГоризонтали = Ложь;
	//			
	//	// Создаем картинку
	//	ПараметрыДекорации = Новый Структура;
	//	ПараметрыДекорации.Вставить("ИмяЭлемента"				, "Картинка_Выбран_ЗавершающийЭтапСделки" + Индекс);
	//	ПараметрыДекорации.Вставить("ГруппаЭлемента"			, ГруппаЭтапа);
	//	ПараметрыДекорации.Вставить("Картинка"					, БиблиотекаКартинок.Пустая);
	//	//ПараметрыДекорации.Вставить("ИмяОбработчикаНажатия"		, "ОбработчикНажатияИзменитьЭтап");
	//	ПараметрыДекорации.Вставить("РастягиватьПоГоризонтали"	, Ложь);
	//	КартинкаВида = УправлениеИнтерфейсамиСервер.СоздатьЭлементДекорация(ЭтаФорма, ПараметрыДекорации);
	//	КартинкаВида.АвтоМаксимальнаяШирина	 				= Ложь;		
	//	КартинкаВида.Ширина					 				= 2;
	//	КартинкаВида.Высота					 				= 1;
	//	КартинкаВида.ВертикальноеПоложениеВГруппе 			= ВертикальноеПоложениеЭлемента.Центр;
	//	
	//	// Создание группы кнопки этапа.
	//	ПараметрыГруппы = Новый Структура;
	//	ПараметрыГруппы.Вставить("ИмяЭлемента"   , "ЭтапЗавершающий_ГруппаКнопки" + Индекс);
	//	ПараметрыГруппы.Вставить("ГруппаЭлемента", ГруппаЭтапа);
	//	ПараметрыГруппы.Вставить("Группировка"   , ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
	//	ГруппаКнопкиЭтапа = УправлениеИнтерфейсамиСервер.СоздатьЭлементГруппа(ЭтаФорма, ПараметрыГруппы);
	//	ГруппаКнопкиЭтапа.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
	//	ГруппаКнопкиЭтапа.Ширина = 30;
	//	ГруппаКнопкиЭтапа.РастягиватьПоГоризонтали = Ложь;
	//	
	//	// Создаем команду кнопки.
	//	ПараметрыКоманды = Новый Структура;
	//	ПараметрыКоманды.Вставить("ИмяОбработчикаНажатия", "ОбработчикНажатияИзменитьЭтап");
	//	ПараметрыКоманды.Вставить("ИмяЭлемента"   	 	 , "Этап_" + Индекс);
	//	КомандаКнопки =  УправлениеИнтерфейсамиСервер.СоздатьКомандуЭлемента(ЭтаФорма, ПараметрыКоманды);
	//	
	//	// Создаем кнопку.
	//	ПараметрыКнопки = Новый Структура;
	//	ПараметрыКнопки.Вставить("Заголовок"   	 	 , ?(СтрокаТЗ.Этап = Справочники.ЭтапыСделок.Успех, НаименованиеЭтапаУспех, НаименованиеЭтапаОтказ));
	//	ПараметрыКнопки.Вставить("ИмяЭлемента"   	 , "Этап_" + Индекс);
	//	ПараметрыКнопки.Вставить("КнопкаОтображение" , ОтображениеКнопки.Текст);
	//	ПараметрыКнопки.Вставить("КомандаКнопки" 	 , КомандаКнопки);
	//	ПараметрыКнопки.Вставить("РазмерШрифта"  	 , 10);
	//	ПараметрыКнопки.Вставить("ГруппаЭлемента"	 , ГруппаКнопкиЭтапа);		
	//	ПараметрыКнопки.Вставить("Доступность"	 	, НЕ ЭтоПервичныйПовторныйПациент);
	//	
	//	КнопкаЭтапа = УправлениеИнтерфейсамиСервер.СоздатьЭлементКнопка(ЭтаФорма, ПараметрыКнопки);
	//	КнопкаЭтапа.РастягиватьПоГоризонтали 	= Истина;	 
	//	
	//	Цвет = ?(СтрокаТЗ.Этап = Справочники.ЭтапыСделок.Успех, Новый Цвет(72, 193, 123), Новый Цвет(246, 110, 110));
	//	
	//	ГруппаКнопкиЭтапа.ЦветФона   	= Цвет;
	//	КнопкаЭтапа.ЦветТекста 			= Новый Цвет(255, 255, 255);
	//	
	//	// Создаем картинку
	//	ПараметрыДекорации = Новый Структура;
	//	ПараметрыДекорации.Вставить("ИмяЭлемента"				, "Картинка_Выбран_ЗавершающийЭтапСделки_пустая" + Индекс);
	//	ПараметрыДекорации.Вставить("ГруппаЭлемента"			, ГруппаЭтапа);
	//	ПараметрыДекорации.Вставить("Картинка"					, БиблиотекаКартинок.Пустая);
	//	//ПараметрыДекорации.Вставить("ИмяОбработчикаНажатия"		, "ОбработчикНажатияИзменитьЭтап");
	//	ПараметрыДекорации.Вставить("РастягиватьПоГоризонтали"	, Ложь);
	//	КартинкаВида = УправлениеИнтерфейсамиСервер.СоздатьЭлементДекорация(ЭтаФорма, ПараметрыДекорации);
	//	КартинкаВида.АвтоМаксимальнаяШирина	 				= Ложь;		
	//	КартинкаВида.Ширина					 				= 2;
	//	КартинкаВида.Высота					 				= 1;
	//	КартинкаВида.ВертикальноеПоложениеВГруппе 			= ВертикальноеПоложениеЭлемента.Центр;
		
	КонецЦикла;
			
КонецПроцедуры

&НаСервере
// Процедура, устанавливает видимость элементов формы.
//
Процедура УстановитьВидимостьЭлементов(ВыбратьЭтап = Ложь, ИзменитьЭтапОтказ = Ложь)
	
	Элементы.ГруппаШапкаВидовСделок.Видимость 					= Ложь;
	Элементы.ГруппаШапкаЭтаповСделок.Видимость 					= Ложь;
	Элементы.ГруппаСписокВидовСделок.Видимость 					= Ложь;
	Элементы.ГруппаШапкаЗавершающихЭтаповСделок.Видимость 		= Ложь;
	Элементы.СделкиДействие.Видимость 							= Ложь;
	
	Если ВыбратьВидГенерируемойСделки Тогда 
		Элементы.ГруппаШапкаВидовСделок.Видимость 				= Истина;
		Элементы.ГруппаШапкаЭтаповСделок.Видимость 				= Истина;
		Элементы.ГруппаШапкаЗавершающихЭтаповСделок.Видимость 	= Истина;		
		Элементы.ГруппаЭтапы.Доступность						= Ложь;
		Элементы.ГруппаШапкаЭтаповСделок.Заголовок 				= "Этапы сделки: " + СокрЛП(Строка(ВыбранныйВидСделки));
		Элементы.ГруппаШапкаЗавершающихЭтаповСделок.Заголовок	= "Завершающие этапы сделки";//"Завершающие этапы сделки: " + СокрЛП(Строка(ВыбранныйВидСделки));				
		ЭтаФорма.Заголовок 										= "Выберите вид сделки";
		ЭтаФорма.Ширина 										= 30;
		ЭтаФорма.Высота 										= 33;		
	ИначеЕсли ВыбратьЭтапГенерируемойСделки Тогда 
		Элементы.ГруппаШапкаЭтаповСделок.Видимость 				= Истина;
		Элементы.ГруппаШапкаЗавершающихЭтаповСделок.Видимость 	= Истина;
		Элементы.ГруппаЗавершающиеЭтапы.Доступность				= Ложь;		
		Элементы.ГруппаШапкаЭтаповСделок.Заголовок 				= "Этапы сделки: " + СокрЛП(Строка(ВыбранныйВидСделки));
		Элементы.ГруппаШапкаЗавершающихЭтаповСделок.Заголовок	= "Завершающие этапы сделки";//"Завершающие этапы сделки: " + СокрЛП(Строка(ВыбранныйВидСделки));						
		ЭтаФорма.Заголовок 										= "Выберите этап сделки";		
		ЭтаФорма.Ширина 										= 30;
		ЭтаФорма.Высота 										= 22;				
	Иначе 	
		ЗаполненыВидыСделок = ЭтотОбъект.СписокВидовСделок.Количество() > 0;
		Если ЗаполненыВидыСделок Тогда
			Элементы.СделкиДействие.Видимость = Ложь;
			Элементы.ГруппаСписокВидовСделок.Видимость = Истина;
		Иначе 
			Элементы.СменитьСделку.Видимость = НЕ ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ЭтотОбъект.Сделка, "ВидСделки"), "Предопределенный");
		КонецЕсли;
		
		Элементы.ГруппаЭтапы.Видимость 							= ВыбратьЭтап ИЛИ ИзменитьЭтапОтказ;
		Элементы.ГруппаШапкаЭтаповСделок.Видимость 				= ВыбратьЭтап ИЛИ ИзменитьЭтапОтказ;
		Элементы.ГруппаЭтапы.Доступность 						= ВыбратьЭтап ИЛИ ИзменитьЭтапОтказ;
		Элементы.ГруппаШапкаЭтаповСделок.Доступность			= ВыбратьЭтап ИЛИ ИзменитьЭтапОтказ;
		Элементы.ГруппаШапкаЗавершающихЭтаповСделок.Видимость 	= ВыбратьЭтап ИЛИ ИзменитьЭтапОтказ;
		Элементы.ГруппаШапкаЗавершающихЭтаповСделок.Доступность = ВыбратьЭтап ИЛИ ИзменитьЭтапОтказ;
		Элементы.ГруппаЗавершающиеЭтапы.Доступность 			= ВыбратьЭтап ИЛИ ИзменитьЭтапОтказ;
		
		Элементы.СделкиДействие.Видимость = НЕ ВыбратьЭтап И НЕ ЗаполненыВидыСделок И НЕ ИзменитьЭтапОтказ;
		
		Если ИзменитьЭтапОтказ Тогда
			Элементы.ГруппаЭтапы_0.Видимость   	     = Ложь;
			Элементы.ГруппаПричиныОтказа_0.Видимость = Истина;	
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Процедура - Сменить сделку на сервере.
//
Процедура СменитьСделкуНаСервере()
	
	МассивВидов = Справочники.ВидыСделок.ПолучитьДоступныеДляГенерацииВидыСделок(, ?(ЗначениеЗаполнено(Контрагент), Контрагент, ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Сделка, "Контрагент")), , Врач);
	ЭтотОбъект.СписокВидовСделок.ЗагрузитьЗначения(МассивВидов);
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаСервере
// Процедура, ОбновитьЭтапыСделки.
//
Процедура ОбновитьЭтапыСделки() 
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Сделка) Тогда 
		Возврат;
	КонецЕсли;
	
	НомерЭтапа 			= ЭтапСделки.НомерЭтапа;
	ТаблицаЭтапов 		= Справочники.ВидыСделок.ПолучитьЭтапыПоВидуСделки(ВидСделки);
	НомерТекущегоЭтапа 	= ОбщегоНазначения.ПолучитьЗначениеРеквизита(ЭтапСделки, "НомерЭтапа");
	Индекс = 0;
	ДопустимОтказ 		= ?(ЭтоПервичныйПовторныйПациент, Справочники.Сделки.ДопустимОтказСогласноТекущегоЭтапа(ЭтотОбъект.Сделка, ЭтоПервичныйПовторныйПациент), Истина);
	
	ИндексВиджета = 0;
	
	// Создание группы.
	ПараметрыГруппы = Новый Структура;
	ПараметрыГруппы.Вставить("ИмяЭлемента"   , "ГруппаЭтапы_" + ИндексВиджета);
	ГруппаРодитель = Элементы.ГруппаЭтапы;
	ПараметрыГруппы.Вставить("ГруппаЭлемента", ГруппаРодитель);	
	ПараметрыГруппы.Вставить("Группировка"   , ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
	ГруппаЭтапы = УправлениеИнтерфейсамиСервер.СоздатьЭлементГруппа(ЭтаФорма, ПараметрыГруппы);
	ГруппаЭтапы.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
	
	Для Каждого СтрокаТЗ Из ТаблицаЭтапов Цикл
		
		ЭтапСделки = СтрокаТЗ.ЭтапСделки;
		
		Если НЕ Индекс = 0 Тогда 
			// Создаем картинку
			ПараметрыДекорации = Новый Структура;
			ПараметрыДекорации.Вставить("ИмяЭлемента"				, "Картинка_СтрелкаВниз_" + Индекс);
			ПараметрыДекорации.Вставить("ГруппаЭлемента"			, ГруппаЭтапы);
			ПараметрыДекорации.Вставить("Картинка"					, БиблиотекаКартинок.СтрелкаВниз);
			//ПараметрыДекорации.Вставить("ИмяОбработчикаНажатия"		, "ОбработчикНажатияИзменитьЭтап");
			ПараметрыДекорации.Вставить("РастягиватьПоГоризонтали"	, Ложь);
			КартинкаВида = УправлениеИнтерфейсамиСервер.СоздатьЭлементДекорация(ЭтаФорма, ПараметрыДекорации);
			КартинкаВида.АвтоМаксимальнаяШирина	 				= Ложь;		
			КартинкаВида.Ширина					 				= 2;
			КартинкаВида.Высота					 				= 1;
			КартинкаВида.ВертикальноеПоложениеВГруппе 			= ВертикальноеПоложениеЭлемента.Центр;
			КартинкаВида.ГоризонтальноеПоложениеВГруппе 		= ГоризонтальноеПоложениеЭлемента.Центр;
		КонецЕсли;
		
		// Создание группы этапа.
		ПараметрыГруппы = Новый Структура;
		ПараметрыГруппы.Вставить("ИмяЭлемента"   , "Этап_" + Индекс + "_" + ИндексВиджета);
		ПараметрыГруппы.Вставить("ГруппаЭлемента", ГруппаЭтапы);
		ПараметрыГруппы.Вставить("Группировка"   , ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
		ГруппаЭтапа = УправлениеИнтерфейсамиСервер.СоздатьЭлементГруппа(ЭтаФорма, ПараметрыГруппы);
		ГруппаЭтапа.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Полуторный;
		ГруппаЭтапа.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
		ГруппаЭтапа.Ширина = 30;
		ГруппаЭтапа.РастягиватьПоГоризонтали = Ложь;
		
		// Создаем картинку
		ПараметрыДекорации = Новый Структура;
		ПараметрыДекорации.Вставить("ИмяЭлемента"				, "Картинка_Выбран_ЭтапСделки" + Индекс);
		ПараметрыДекорации.Вставить("ГруппаЭлемента"			, ГруппаЭтапа);
		ПараметрыДекорации.Вставить("Картинка"					, ?(СтрокаТЗ.НомерЭтапа = НомерЭтапа, БиблиотекаКартинок.ЧекБоксПолный, БиблиотекаКартинок.Пустая));
		//ПараметрыДекорации.Вставить("ИмяОбработчикаНажатия"		, "ОбработчикНажатияИзменитьЭтап");
		ПараметрыДекорации.Вставить("РастягиватьПоГоризонтали"	, Ложь);
		КартинкаВида = УправлениеИнтерфейсамиСервер.СоздатьЭлементДекорация(ЭтаФорма, ПараметрыДекорации);
		КартинкаВида.АвтоМаксимальнаяШирина	 				= Ложь;		
		КартинкаВида.Ширина					 				= 2;
		КартинкаВида.Высота					 				= 1;
		КартинкаВида.ВертикальноеПоложениеВГруппе 			= ВертикальноеПоложениеЭлемента.Центр;
		
		// Создание группы кнопки этапа.
		ПараметрыГруппы = Новый Структура;
		ПараметрыГруппы.Вставить("ИмяЭлемента"   , "Этап_ГруппаКнопки" + Индекс);
		ПараметрыГруппы.Вставить("ГруппаЭлемента", ГруппаЭтапа);
		ПараметрыГруппы.Вставить("Группировка"   , ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
		ГруппаКнопкиЭтапа = УправлениеИнтерфейсамиСервер.СоздатьЭлементГруппа(ЭтаФорма, ПараметрыГруппы);
		ГруппаКнопкиЭтапа.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
		ГруппаКнопкиЭтапа.Ширина = 30;
		ГруппаКнопкиЭтапа.РастягиватьПоГоризонтали = Ложь;
		
		// Создаем команду кнопки.
		ПараметрыКоманды = Новый Структура;
		ПараметрыКоманды.Вставить("ИмяОбработчикаНажатия", "ОбработчикНажатияИзменитьЭтап");
		ПараметрыКоманды.Вставить("ИмяЭлемента"   	 	 , "Этап_" + Индекс + "_" + ИндексВиджета);
		КомандаКнопки =  УправлениеИнтерфейсамиСервер.СоздатьКомандуЭлемента(ЭтаФорма, ПараметрыКоманды);
		
		// Создаем кнопку.
		ПараметрыКнопки = Новый Структура;
		ПараметрыКнопки.Вставить("Заголовок"   	 	 , ЭтапСделки);
		ПараметрыКнопки.Вставить("ИмяЭлемента"   	 , "Этап_" + Индекс + "_" + ИндексВиджета);
		ПараметрыКнопки.Вставить("КнопкаОтображение" , ОтображениеКнопки.Текст);
		ПараметрыКнопки.Вставить("КомандаКнопки" 	 , КомандаКнопки);
		ПараметрыКнопки.Вставить("РазмерШрифта"  	 , 10);
		ПараметрыКнопки.Вставить("ГруппаЭлемента"	 , ГруппаКнопкиЭтапа);		
		
		КнопкаЭтапа = УправлениеИнтерфейсамиСервер.СоздатьЭлементКнопка(ЭтаФорма, ПараметрыКнопки);
		КнопкаЭтапа.РастягиватьПоГоризонтали = Истина;	 
		
		Если ЭтоПервичныйПовторныйПациент Тогда
			Если ЗначениеЗаполнено(РезультатСделки) Тогда
				Если РезультатСделки = Перечисления.РезультатыСделок.Успех Тогда 
					КнопкаЭтапа.Доступность 	= Ложь;
				Иначе 
					КнопкаЭтапа.Доступность 	= ДопустимОтказ И (СтрокаТЗ.НомерЭтапа = 1 ИЛИ СтрокаТЗ.НомерЭтапа = 2);
				КонецЕсли;	
			ИначеЕсли СтрокаТЗ.НомерЭтапа = 1 ИЛИ СтрокаТЗ.НомерЭтапа = 2 Тогда
				КнопкаЭтапа.Доступность 		= НомерТекущегоЭтапа < 3;
			ИначеЕсли СтрокаТЗ.НомерЭтапа = 3 Тогда 
				КнопкаЭтапа.Доступность 		= Ложь;
			ИначеЕсли СтрокаТЗ.НомерЭтапа = 4 Тогда 	
				КнопкаЭтапа.Доступность 		= Ложь;//НомерТекущегоЭтапа > 2;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЗ.ЦветЭтапа)
			ИЛИ ЗначениеИзСтрокиВнутр(СтрокаТЗ.ЦветЭтапа) = Новый Цвет()
			ИЛИ СтрокаТЗ.НомерЭтапа > НомерЭтапа Тогда 
			Если СтрокаТЗ.НомерЭтапа = НомерЭтапа Тогда
				Цвет = Новый Цвет(229, 229, 229);
			Иначе 	
				Цвет = Новый Цвет(243, 243, 243);
			КонецЕсли;
		ИначеЕсли СтрокаТЗ.НомерЭтапа = НомерЭтапа Тогда
			Цвет = ЗначениеИзСтрокиВнутр(СтрокаТЗ.ЦветЭтапа);
		Иначе		
			Цвет = ЗначениеИзСтрокиВнутр(СтрокаТЗ.ЦветЭтапа);
		КонецЕсли;
		
		//Если НЕ ЗначениеЗаполнено(СтрокаТЗ.ЦветЭтапа)
		//	ИЛИ ЗначениеИзСтрокиВнутр(СтрокаТЗ.ЦветЭтапа) = Новый Цвет() Тогда
		//	
		//	Цвет = Новый Цвет(0,112,210);
		//Иначе		
		//	Цвет = ЗначениеИзСтрокиВнутр(СтрокаТЗ.ЦветЭтапа);
		//КонецЕсли;
		
		ГруппаКнопкиЭтапа.ЦветФона   	= Цвет;
		КнопкаЭтапа.ЦветТекста 			= УправлениеИнтерфейсамиСервер.ПолучитьЦветТекстаПоФону(ГруппаКнопкиЭтапа.ЦветФона);
		
		// Создаем картинку
		ПараметрыДекорации = Новый Структура;
		ПараметрыДекорации.Вставить("ИмяЭлемента"				, "Картинка_Выбран_ЭтапСделки_пустая" + Индекс);
		ПараметрыДекорации.Вставить("ГруппаЭлемента"			, ГруппаЭтапа);
		ПараметрыДекорации.Вставить("Картинка"					, БиблиотекаКартинок.Пустая);
		//ПараметрыДекорации.Вставить("ИмяОбработчикаНажатия"		, "ОбработчикНажатияИзменитьЭтап");
		ПараметрыДекорации.Вставить("РастягиватьПоГоризонтали"	, Ложь);
		КартинкаВида = УправлениеИнтерфейсамиСервер.СоздатьЭлементДекорация(ЭтаФорма, ПараметрыДекорации);
		КартинкаВида.АвтоМаксимальнаяШирина	 				= Ложь;		
		КартинкаВида.Ширина					 				= 2;
		КартинкаВида.Высота					 				= 1;
		КартинкаВида.ВертикальноеПоложениеВГруппе 			= ВертикальноеПоложениеЭлемента.Центр;
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	//Если НЕ ЭтоПервичныйПовторныйПациент ИЛИ (ЭтоПервичныйПовторныйПациент И РезультатСделки = Перечисления.РезультатыСделок.ПустаяСсылка()) Тогда 
	//	Возврат;
	//КонецЕсли;
	
	// Создание группы.
	ПараметрыГруппы = Новый Структура;
	ПараметрыГруппы.Вставить("ИмяЭлемента"   , "ГруппаЗавершающиеЭтапы_" + 0);
	ГруппаРодитель = Элементы.ГруппаЗавершающиеЭтапы;
	ПараметрыГруппы.Вставить("ГруппаЭлемента", ГруппаРодитель);	
	ПараметрыГруппы.Вставить("Группировка"   , ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
	ГруппаЗавершающиеЭтапы = УправлениеИнтерфейсамиСервер.СоздатьЭлементГруппа(ЭтаФорма, ПараметрыГруппы);
	ГруппаЗавершающиеЭтапы.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Одинарный;
	
	НаименованиеЭтапаУспех = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ВидСделки, "НаименованиеЭтапаУспех");
	НаименованиеЭтапаУспех = ?(ЗначениеЗаполнено(СокрЛП(НаименованиеЭтапаУспех)), СокрЛП(НаименованиеЭтапаУспех), НСтр("ru = 'Успех'; en = 'Success'"));
	НаименованиеЭтапаОтказ = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ВидСделки, "НаименованиеЭтапаОтказ");
	НаименованиеЭтапаОтказ = ?(ЗначениеЗаполнено(СокрЛП(НаименованиеЭтапаОтказ)), СокрЛП(НаименованиеЭтапаОтказ), НСтр("ru = 'Отказ'; en = 'Denial'"));
	
	ДоступностьЗавершающихЭтапов = НЕ ЭтоПервичныйПовторныйПациент;
	
	УправлениеИнтерфейсамиСервер.СоздатьКнопкуРезультатаСделки(ЭтаФорма, НаименованиеЭтапаУспех, ГруппаЗавершающиеЭтапы, , , Перечисления.РезультатыСделок.Успех, РезультатСделки, , ДоступностьЗавершающихЭтапов);
	УправлениеИнтерфейсамиСервер.СоздатьГруппуПрием(ЭтаФорма, ИндексВиджета, Элементы.Выравнивание);
	Если ПричиныПредопределены Тогда 
		Для Каждого СтрокаПричина Из ПричиныОтказов Цикл
			ДоступностьЗавершающихЭтапов = НЕ ЭтоПервичныйПовторныйПациент;			
			Если ЭтоПервичныйПовторныйПациент И СтрокаПричина.Ссылка = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПричиныОтказов.КлиентОтказался") Тогда 
				Если НЕ ЗначениеЗаполнено(ЭтотОбъект.РезультатСделки) И Справочники.Сделки.ДопустимОтказСогласноТекущегоЭтапа(ЭтотОбъект.Сделка, ЭтоПервичныйПовторныйПациент) Тогда 
					ДоступностьЗавершающихЭтапов = Истина;
				КонецЕсли; 
			КонецЕсли;	
			УправлениеИнтерфейсамиСервер.СоздатьКнопкуРезультатаСделки(ЭтаФорма, СокрЛП(СтрокаПричина.Наименование), ГруппаЗавершающиеЭтапы, , , Перечисления.РезультатыСделок.Отказ, РезультатСделки, ПричиныОтказов.Индекс(СтрокаПричина), ДоступностьЗавершающихЭтапов, СтрокаПричина.Ссылка);
		КонецЦикла;	
	Иначе 	
		УправлениеИнтерфейсамиСервер.СоздатьКнопкуРезультатаСделки(ЭтаФорма, НаименованиеЭтапаОтказ, ГруппаЗавершающиеЭтапы, , , Перечисления.РезультатыСделок.Отказ, РезультатСделки, , ДоступностьЗавершающихЭтапов);
		УправлениеИнтерфейсамиСервер.СоздатьГруппуПричинОтказа(ЭтаФорма, Элементы.Выравнивание, ИндексВиджета);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, ОбновитьСделку.
//
Процедура ОбновитьСделку(ИмяКоманды)
	
	Если СтрНайти(ИмяКоманды, "КомандаЭтап") > 0 Тогда		
		
		ИндексВиджета 	= ПолучитьИндексСтроки(ИмяКоманды, Ложь);
		ИндексЭтапа     = ПолучитьИндексСтроки(ИмяКоманды);
		УправлениеИнтерфейсамиСервер.ОбновитьЭтапСделки(ЭтотОбъект.Сделка, ИндексЭтапа);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Функция, возвращает идентификатор строки данных по имени элемента.
//
// Параметры:
//	 ИмяЭлемента 	- Строка - имя элемента.
//   ИндексЭлемента - Булево - признак чего получаем индекс (Элемента или Виджета).
//
Функция ПолучитьИндексСтроки(ЗНАЧ ИмяЭлемента, ИндексЭлемента = Истина)

	НомерСимвола = СтрНайти(ИмяЭлемента, "_ИндексПричины_");
	Если ЗначениеЗаполнено(НомерСимвола) Тогда 
		ИмяЭлемента = Лев(ИмяЭлемента, НомерСимвола-1);
	КонецЕсли;
	
	Если ИндексЭлемента Тогда
		НомерСимвола = СтрНайти(ИмяЭлемента,"_");
		
		Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Сред(ИмяЭлемента, НомерСимвола + 1, 2)) Тогда
			Возврат Число(Сред(ИмяЭлемента, НомерСимвола + 1, 2));
		Иначе		
			Возврат Число(Сред(ИмяЭлемента, НомерСимвола + 1, 1));	
		КонецЕсли;		
		
	Иначе
		НомерСимвола = СтрНайти(ИмяЭлемента,"_", НаправлениеПоиска.СКонца);
		Возврат Число(Сред(ИмяЭлемента, НомерСимвола + 1));
	КонецЕсли;
	
КонецФункции

&НаКлиенте
// Процедура, ВыбратьРеализациюЗавершение.
//
Процедура ВыбратьРеализациюЗавершение(Результат, ДопПараметры) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат;		
	КонецЕсли;
	
	ВыбратьРеализациюЗавершениеНаСервере(Результат, ДопПараметры);
	Оповестить("ОБНОВИТЬ_ЭТАПЫ_СДЕЛКИ");
	Оповестить("ОБНОВИТЬ_ВИДЖЕТ_СДЕЛКИ");
	Если ЭтаФорма.Открыта() Тогда
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, ВыбратьРеализациюЗавершениеНаСервере.
//
Процедура ВыбратьРеализациюЗавершениеНаСервере(Продажа, Сделка)
	
	УправлениеИнтерфейсамиСервер.ОбновитьЭтапУспех(Сделка, Продажа);
	
КонецПроцедуры

&НаКлиенте
// Процедура, открывает форму продажи.
//
Процедура ОткрытьФормуПродажи(ИндексВиджета)
	
	Сделка = ЭтотОбъект.Сделка;
	
	Структура = Новый Структура();
	Структура.Вставить("Контрагент"			, ЭтотОбъект.Контрагент);
	Структура.Вставить("Сделка"	   			, Сделка);
	ПараметрыФормы  = Новый Структура("ЗначенияЗаполнения", Структура);	
	НовоеОповещение = Новый ОписаниеОповещения("СоздатьРеализациюЗавершение", ЭтотОбъект, Сделка);
	
	ОткрытьФорму("Документ.Прием.Форма.ФормаДокумента",ПараметрыФормы,,,,,НовоеОповещение);
	
КонецПроцедуры

&НаКлиенте
// Процедура, СоздатьРеализациюЗавершение.
//
Процедура СоздатьРеализациюЗавершение(Результат, ДопПараметры) Экспорт
	
	СоздатьРеализациюЗавершениеНаСервере(ДопПараметры);
	Оповестить("ОБНОВИТЬ_ЭТАПЫ_СДЕЛКИ");
	Оповестить("ОБНОВИТЬ_ВИДЖЕТ_СДЕЛКИ");
	Если ЭтаФорма.Открыта() Тогда
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, СоздатьРеализациюЗавершениеНаСервере.
//
Процедура СоздатьРеализациюЗавершениеНаСервере(Сделка)
	
	Прием = ПолучитьПоследнююПродажуПоСделке(Сделка);
	Если ЗначениеЗаполнено(Прием) Тогда
		УправлениеИнтерфейсамиСервер.ОбновитьЭтапУспех(Сделка, Прием);		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, ПолучитьПоследнююПродажуПоСделке.
//
Функция ПолучитьПоследнююПродажуПоСделке(Сделка)
	
	Если НЕ ЗначениеЗаполнено(Сделка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Прием.Ссылка КАК Продажа
	|ИЗ
	|	Документ.Прием КАК Прием
	|ГДЕ
	|	Прием.Сделка = &Сделка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Прием.Дата УБЫВ";
	Запрос.УстановитьПараметр("Сделка", Сделка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗначениеВозврата = ?( Выборка.Следующий(), Выборка.Продажа, Неопределено);
	
	Возврат ЗначениеВозврата;
	
КонецФункции

&НаКлиенте
// Функция - Получить выбранную причину отказа
//
// Параметры:
//  ИмяКоманда	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьВыбраннуюПричинуОтказа(ЗНАЧ ИмяКоманда)
	
	Попытка	
		НомерСимвола = СтрНайти(ИмяКоманда,"_ИндексПричины_");
		Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Сред(ИмяКоманда, НомерСимвола + СтрДлина("_ИндексПричины_"), 2)) Тогда
			ИндексПричины = Число(Сред(ИмяКоманда, НомерСимвола + СтрДлина("_ИндексПричины_"), 2));
		Иначе
			ИндексПричины = Число(Сред(ИмяКоманда, НомерСимвола + СтрДлина("_ИндексПричины_"), 1));
		КонецЕсли;
		Возврат ПричиныОтказов.Получить(ИндексПричины).Ссылка;		
	Исключение 
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнены входящие данные'; en = 'Incoming data is not filled'"));
		Возврат Неопределено;
	КонецПопытки;	
	
КонецФункции

&НаСервере
// Процедура, ОбновитьПричинуОтказаВыборНаСервере.
//
Процедура ОбновитьПричинуОтказаВыборНаСервере(ПричинаОтказа, ИмяЭлемента)	
	
	ОбновитьПричинуОтказа(ПричинаОтказа, ИмяЭлемента);
	
КонецПроцедуры

&НаСервере
// Процедура, обновляет причину отказа в сделке.
//
// Параметры:
// 	Форма 			- управляемая форма - форма объекта.
//	ПричинаОтказа 	- Ссылка  			- элемент справочника, причины отказов.
//	ИмяЭлемента 	- Строка 			- имя нажатого элемента виджета(имя нажатой таблицы отказов).
// 
Процедура ОбновитьПричинуОтказа(знач ПричинаОтказа, знач ИмяЭлемента)
	
	Если НЕ ЗначениеЗаполнено(ПричинаОтказа) ИЛИ НЕ ЗначениеЗаполнено(ИмяЭлемента) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнены входящие данные'; en = 'Incoming data is not filled'"));
		Возврат;
	КонецЕсли;
	
	ИндексВиджета 	= ПолучитьИндексСтроки(ИмяЭлемента, Ложь);
	
	Сделка 		= ЭтотОбъект.Сделка;
	
	ОбъектСделка  	= Сделка.ПолучитьОбъект(); 
	Прием	 		= ОбъектСделка.Прием;
	ОбъектСделка.РезультатСделки 		= Перечисления.РезультатыСделок.Отказ;
	Если ЗначениеЗаполнено(ОбъектСделка.ЭтапСделки) И НЕ ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ОбъектСделка.ЭтапСделки, "Предопределенный") Тогда 
		ОбъектСделка.ЭтапОтказа 		= ОбъектСделка.ЭтапСделки;
	ИначеЕсли НЕ ЗначениеЗаполнено(ОбъектСделка.ЭтапОтказа) Тогда 
		ОбъектСделка.ЭтапОтказа 		= Справочники.ВидыСделок.ПолучитьСтартовыйЭтапВидаСделки(ОбъектСделка.ВидСделки);
	КонецЕсли;	
	ОбъектСделка.ЭтапСделки		 		= Справочники.ЭтапыСделок.Отказ;
	ОбъектСделка.ПричинаОтказа	 	  	= ПричинаОтказа;
	ОбъектСделка.ДатаЗавершенияСделки 	= Неопределено;
	ОбъектСделка.Прием					= Неопределено;
	
	Если ЗначениеЗаполнено(Прием) Тогда
		ДокументРеализация = Прием.ПолучитьОбъект();
		ДокументРеализация.Сделка = Неопределено;
	КонецЕсли;
	
	НачатьТранзакцию();	
	Попытка
		ОбъектСделка.Записать();
		Если ЗначениеЗаполнено(Прием) Тогда
			ДокументРеализация.Записать(?(ДокументРеализация.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
		КонецЕсли;
		ЗафиксироватьТранзакцию();			
	Исключение
		ОтменитьТранзакцию();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
